# Kaggle.com

Kaggle.com самый популярный сайт для Data Scientist-ов. На сайте выложено большое количество датасетов, которые можно использовать в исследовательских целях.


## Titanic: Machine Learning from Disaster

Популярный датасет, который часто используют на курсах по основам data science. Чтобы получить данные:

* Зарегистрируйтесь на Kaggle.com
* Активируйте аккаунт
* Перейдите на страницу датасета: https://www.kaggle.com/c/titanic/data
* Нажмите Join Competition и согласитесь с условиями

In [1]:
import pandas as pd

## Посмотрим на данные

In [2]:
df = pd.read_csv('titanic/train.csv')

In [5]:
df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
547,548,1,2,"Padro y Manent, Mr. Julian",male,NaN,0,0,SC/PARIS 2146,13.8625,NaN,C
253,254,0,3,"Lobb, Mr. William Arthur",male,30.0,1,0,A/5. 3336,16.1000,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
454,455,0,3,"Peduzzi, Mr. Joseph",male,NaN,0,0,A/5 2817,8.0500,NaN,S
808,809,0,2,"Meyer, Mr. August",male,39.0,0,0,248723,13.0000,NaN,S
448,449,1,3,"Baclini, Miss. Marie Catherine",female,5.0,2,1,2666,19.2583,NaN,C
751,752,1,3,"Moor, Master. Meier",male,6.0,0,1,392096,12.4750,E121,S
752,753,0,3,"Vande Velde, Mr. Johannes Joseph",male,33.0,0,0,345780,9.5000,NaN,S
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S


* Survived - спасся ли пассажир (да- 1 или нет - 0)
* Pclass - класс билета (1-й, 2-й или 3-Й)
* SibSp - муж/жена/братья/сестры на борту
* Parch - родители/дети на борту
* Embarked - порт посадки (С - Cherbourg, S - Southampton, Q = Queenstown)

## Проверим данные

Удобный способ взглянуть на данные df.info(). Видно, что у полей Age, Cabin и Embarked есть пустые значения. Порт посадки не указан всего у двух пассажиров, давайте укажим у них самый популярный порт:

`embarked = df.groupby('Embarked').count()['PassengerId'] 
 embarked_max = embarked[embarked == embarked.max()].index[0] 
 df.loc[df['Embarked'].isnull(), 'Embarked'] = embarked_max `

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [7]:
df.loc[df['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [10]:
embarked = df.groupby('Embarked').count()['PassengerId']

In [11]:
embarked

Embarked
C    168
Q     77
S    644
Name: PassengerId, dtype: int64

In [16]:
embarked[embarked == embarked.max()]

Embarked
S    644
Name: PassengerId, dtype: int64

In [17]:
embarked[embarked == embarked.max()].index[0]

'S'

In [18]:
embarked_max = embarked[embarked == embarked.max()].index[0]

In [19]:
df.loc[df['Embarked'].isnull(), 'Embarked']

61     NaN
829    NaN
Name: Embarked, dtype: object

In [20]:
df.loc[df['Embarked'].isnull(), 'Embarked'] = embarked_max

In [22]:
df.loc[df['Embarked'].isnull()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [25]:
df['Age'].median()

28.0

## Создадим колонку с титулами

Сначала получим их из колонки Name:

In [38]:
df['Name'].str.extract('([A-Za-z]+)\.').sample(10)

          0
15      Mrs
549  Master
556    Lady
69       Mr
582      Mr
763     Mrs
32     Miss
300    Miss
686      Mr
60       Mr

Положим результат в отдельную колонку и проверим, что получилось:

In [31]:
df['Title'] = df['Name'].str.extract('([A-Za-z]+)\.')
df['Title'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'Countess',
       'Jonkheer'], dtype=object)